import Scene from "./Scene";
import TCRoute from "./TCRoute";
import Tittle from "./Tittle";

const Details = () => {
    const items = ['A - Депо - г. Уфа, ул. Гильманова 69', 
        'B - ЧВК "Вагнер" - с. Янаул, ул. Красивая 7', 
        'C - ЧВК "Вагнер" - с. Янаул, ул. Красивая 7',  
        'ЧВК "Вагнер" - с. Янаул, ул. Красивая 7',  
        'ЧВК "Вагнер" - с. Янаул, ул. Красивая 7', 
        'ЧВК "Вагнер" - с. Янаул, ул. Красивая 7', 
        'ЧВК "Вагнер" - с. Янаул, ул. Красивая 7',  
        'ЧВК "Вагнер" - с. Янаул, ул. Красивая 7',  
        'ЧВК "Вагнер" - с. Янаул, ул. Красивая 7', 
        'Депо - г. Уфа, ул. Гильманова 69'];

    const boxes = [
        [ 0, 0, 0, 6, 11, 5 ],    [ 0, 0, 5, 12, 7, 5 ],
        [ 0, 0, 10, 15, 5, 7 ],   [ 0, 7, 5, 5, 6, 11 ],
        [ 0, 11, 0, 12, 7, 5 ],   [ 0, 13, 5, 7, 15, 5 ],
        [ 0, 28, 0, 6, 5, 11 ],   [ 0, 13, 10, 12, 5, 7 ],
        [ 0, 18, 10, 15, 5, 7 ],  [ 0, 23, 11, 5, 11, 6 ],
        [ 0, 18, 0, 12, 7, 5, true ],   [ 0, 33, 0, 5, 15, 7 ],
        [ 0, 34, 7, 5, 6, 11 ],   [ 0, 40, 7, 5, 12, 7 ],
        [ 0, 48, 0, 15, 5, 7 ],   [ 0, 40, 14, 6, 11, 5 ],
        [ 5, 23, 11, 5, 12, 7 ],  [ 5, 33, 0, 5, 15, 7 ],
        [ 0, 51, 14, 11, 6, 5 ],  [ 0, 52, 7, 12, 5, 7 ],
        [ 5, 35, 7, 5, 15, 7 ],   [ 6, 0, 0, 6, 11, 5 ],
        [ 0, 53, 0, 12, 5, 7 ],   [ 5, 5, 10, 15, 7, 5 ],
        [ 6, 35, 14, 5, 11, 6 ],  [ 10, 23, 5, 5, 12, 7 ],
        [ 11, 35, 0, 7, 5, 15 ],  [ 5, 5, 15, 11, 6, 5 ],
        [ 10, 23, 12, 12, 5, 7, true ], [ 7, 7, 5, 7, 15, 5 ],
        [ 10, 40, 7, 5, 11, 6 ],  [ 6, 25, 0, 12, 7, 5 ],
        [ 12, 53, 0, 5, 7, 15 ],  [ 6, 46, 14, 11, 5, 6 ],
        [ 14, 12, 0, 7, 5, 12 ],  [ 10, 28, 12, 15, 7, 5 ],
        [ 10, 40, 0, 11, 5, 6 ],  [ 11, 40, 13, 12, 5, 7 ],
        [ 15, 17, 5, 5, 15, 7 ],  [ 12, 0, 0, 6, 11, 5 ],
        [ 15, 45, 0, 5, 7, 12 ],  [ 15, 0, 5, 7, 5, 15 ],
        [ 15, 12, 12, 5, 11, 6 ], [ 15, 40, 6, 12, 5, 7 ],
        [ 11, 51, 15, 15, 7, 5 ], [ 17, 52, 0, 6, 5, 11 ],
        [ 12, 17, 0, 12, 7, 5, true ],  [ 18, 35, 0, 7, 5, 15 ]
      ];
    return (
        <div className=' min-w-[800px] min-h-[420px] overflow-y-scroll p-2 rounded-md border-2 border-solid border-zinc-300 h-96'>
            <Tittle 
                text={'Что-то про ТС'}
                description={'описание разлчиный деталей'}/>
            <TCRoute items={items}/>
            <div className=' w-[720px] h-[360px] mt-8 mb-4 mx-auto rounded-md border-2 border-solid border-zinc-300'>
                <Scene boxes={boxes} containerDimensions={[60, 20, 60]}/>
            </div>
        </div>
    );
}
  
export default Details;